devinzhang91/Health-Box/STM32/Platform/HARDWARE/LCD/LCD.h
#ifndef __LCD_H
#define	__LCD_H

#include "stm32f10x.h"

/***************************************************************************************
2^26 =0X0400 0000 = 64MB,每个 BANK 有4*64MB = 256MB
64MB:FSMC_Bank1_NORSRAM1:0X6000 0000 ~ 0X63FF FFFF
64MB:FSMC_Bank1_NORSRAM2:0X6400 0000 ~ 0X67FF FFFF
64MB:FSMC_Bank1_NORSRAM3:0X6800 0000 ~ 0X6BFF FFFF
64MB:FSMC_Bank1_NORSRAM4:0X6C00 0000 ~ 0X6FFF FFFF

选择BANK1-BORSRAM4 连接 TFT，地址范围为0X6C00 0000 ~ 0X6FFF FFFF
FSMC_A23 接LCD的DC(寄存器/数据选择)脚
寄存器基地址 = 0X6C00 0000
RAM基地址 = 0X6D00 0000 = 0X6C00 0000+2^23*2 = 0X6C00 0000 + 0X100 0000 = 0X6D00 0000
当选择不同的地址线时，地址要重新计算  
****************************************************************************************/


#define R0             0x00
#define R1             0x01
#define R2             0x02
#define R3             0x03
#define R4             0x04
#define R5             0x05
#define R6             0x06
#define R7             0x07
#define R8             0x08
#define R9             0x09
#define R10            0x0A
#define R12            0x0C
#define R13            0x0D
#define R14            0x0E
#define R15            0x0F
#define R16            0x10
#define R17            0x11
#define R18            0x12
#define R19            0x13
#define R20            0x14
#define R21            0x15
#define R22            0x16
#define R23            0x17
#define R24            0x18
#define R25            0x19
#define R26            0x1A
#define R27            0x1B
#define R28            0x1C
#define R29            0x1D
#define R30            0x1E
#define R31            0x1F
#define R32            0x20
#define R33            0x21
#define R34            0x22
#define R36            0x24
#define R37            0x25
#define R40            0x28
#define R41            0x29
#define R43            0x2B
#define R45            0x2D
#define R48            0x30
#define R49            0x31
#define R50            0x32
#define R51            0x33
#define R52            0x34
#define R53            0x35
#define R54            0x36
#define R55            0x37
#define R56            0x38
#define R57            0x39
#define R58            0x3A
#define R59            0x3B
#define R60            0x3C
#define R61            0x3D
#define R62            0x3E
#define R63            0x3F
#define R64            0x40
#define R65            0x41
#define R66            0x42
#define R67            0x43
#define R68            0x44
#define R69            0x45
#define R70            0x46
#define R71            0x47
#define R72            0x48
#define R73            0x49
#define R74            0x4A
#define R75            0x4B
#define R76            0x4C
#define R77            0x4D
#define R78            0x4E
#define R79            0x4F
#define R80            0x50
#define R81            0x51
#define R82            0x52
#define R83            0x53
#define R96            0x60
#define R97            0x61
#define R106           0x6A
#define R118           0x76
#define R128           0x80
#define R129           0x81
#define R130           0x82
#define R131           0x83
#define R132           0x84
#define R133           0x85
#define R134           0x86
#define R135           0x87
#define R136           0x88
#define R137           0x89
#define R139           0x8B
#define R140           0x8C
#define R141           0x8D
#define R143           0x8F
#define R144           0x90
#define R145           0x91
#define R146           0x92
#define R147           0x93
#define R148           0x94
#define R149           0x95
#define R150           0x96
#define R151           0x97
#define R152           0x98
#define R153           0x99
#define R154           0x9A
#define R157           0x9D
#define R192           0xC0
#define R193           0xC1
#define R229           0xE5
/* LCD color */
#define White          0xFFFF
#define Black          0x0000
#define Grey           0xF7DE
#define Blue           0x001F
#define Blue2          0x051F
#define Red            0xF800
#define Magenta        0xF81F
#define Green          0x07E0
#define Cyan           0x7FFF
#define Yellow         0xFFE0

void LCD_Init(void);
void LCD_Clear(u16 Color);
void LCD_WriteRAM_Prepare(void);
void LCD_WriteRAM(u16 LCD_RegValue);
u16 LCD_ReadReg(u16 LCD_Reg);
void LCD_WriteReg(u8 LCD_Reg, u16 LCD_RegValue)	;
// void LCD_WriteBMP( u16 Height, u16 Width, u8 *bitmap);
void LCD_guanjiao(void);
void LCD_FSMC(void);
void LCD_SetPoint(u16 x,u16 y,u16 point);
void LCD_SetCursor(u16 x,u16 y);
u16 LCD_GetPoint(u16 x,u16 y);
u16 LCD_BGR2RGB(u16 c);
u16 LCD_ReadRAM(void);

void LCD_Draw_Circle(u16 x0,u16 y0,u8 r,u16 pointColor);					    				//画圆
void LCD_DrawLine(u16 x1, u16 y1, u16 x2, u16 y2,u16 pointColor);							//画线
void LCD_DrawRectangle(u16 x1, u16 y1, u16 x2, u16 y2,u16 pointColor);		  	//画矩形
void LCD_Draw_Target(u16 x,u16 y,u16 pointColor);															//画目标
void LCD_Draw_Button(u16 x, u16 y, u8 type);
void LCD_ShowChar(u16 x,u16 y,u32 c, u16 charColor);					//显示一个字符
void LCD_printString(u16 x,u16 y, u8 *ptr, u16 charColor);		//显示字符串
void LCD_ShowNum(u16 x,u16 y,u32 num,u16 charColor);					//显示数字
// void LCD_WriteBMP(u16 x, u16 y, u16 height, u16 width, u8 *bitmap);						//画位图
void LCD_WriteFullBMP(u8 *bitmap);																						//画一整张位图
void LCD_Color_Fill(u16 sx,u16 sy,u16 ex,u16 ey,u16 color);	//在指定区域内填充指定颜色块

void Add_Button(void);

#endif

